Autodesk.Revit.DB.ScheduleSheetInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Create an instance of a schedule on a sheet.
document:
The document
viewSheetId:
The id of the sheet where the schedule will be placed.
scheduleId:
The id of the schedule view.
origin:
Location on the sheet where the schedule will be placed.
Returns:
The new ScheduleInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
scheduleId is not a ViewSchedule that can be added to sheets. "Internal" schedules that are not user-visible but that are used in Revit to manage Keynotes and Revisions cannot be added to sheets.
-or-
viewSheetId is not a ViewSheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.IsTitleblockRevisionSchedule
Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
Remarks:
These schedule instances should not be modified in the project environment. To modify the revision schedule on a titleblock, edit the titleblock family.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.Rotation
Rotation of the ScheduleInstance.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks.
-or-
When setting this property: This operation is prohibited for ScheduleInstances that are pinned.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.Point
Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.ScheduleId
Id of the "master" schedule that generates this ScheduleInstance.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance
An element that represents a particular placement of a schedule on a sheet.
Remarks:
Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
Since:
2013